### Pages
## General pages
#Header and footer
header.settings = \u041D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438
header.logout = \u0412\u044B\u0439\u0442\u0438
header.language = \u042F\u0437\u044B\u043A
header.language.en = \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439
header.language.ru = \u0420\u0443\u0441\u0441\u043A\u0438\u0439
header.theme = \u0422\u0435\u043C\u0430
header.theme.dark = \u0422\u0451\u043C\u043D\u0430\u044F
header.theme.light = \u0421\u0432\u0435\u0442\u043B\u0430\u044F
header.users = \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438
header.tests = \u0422\u0435\u0441\u0442\u044B
header.journal = \u0416\u0443\u0440\u043D\u0430\u043B
header.login = \u0412\u043E\u0439\u0442\u0438
header.register = \u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F

footer.message = \u041F\u0440\u043E\u0435\u043A\u0442 «Test Center» \u041A\u0430\u0442\u0435\u0440\u0438\u043D\u0430 \u041A\u0430\u0440\u0434\u0430\u0448 2017

#Error page
errorpage.title = \u041E\u0448\u0438\u0431\u043A\u0430
errorpage.header = \u0427\u0442\u043E-\u0442\u043E \u043F\u043E\u0448\u043B\u043E \u043D\u0435 \u0442\u0430\u043A
errorpage.defmessage = \u0412\u044B \u043F\u044B\u0442\u0430\u0435\u0442\u0435\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u043D\u0435\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0439 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435, \u0438\u043B\u0438 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u043D\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u043E\u0439 \u0441 \u0432\u0430\u0448\u0438\u043C \u0443\u0440\u043E\u0432\u043D\u0435\u043C \u0430\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u0438.<br>\u0412\u0435\u0440\u043D\u0438\u0442\u0435\u0441\u044C \u0438\u043B\u0438 \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u043F\u0435\u0440\u0435\u0439\u0442\u0438 \u043D\u0430 \u0434\u0440\u0443\u0433\u0443\u044E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443.

#Index
index.welcome = \u0414\u043E\u0431\u0440\u043E \u043F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C

index.guest.message = \u042D\u0442\u043E \u043F\u0440\u043E\u0435\u043A\u0442 \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043A\u0438 Java Epam \u043E\u0442 \u041A\u0430\u0442\u0435\u0440\u0438\u043D\u044B \u041A\u0430\u0440\u0434\u0430\u0448. <br> \u042D\u0442\u043E \u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u0430 \u0434\u043B\u044F \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u0433\u0434\u0435 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F, \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442\u044C \u0442\u0435\u0441\u0442\u044B \u0438 \u043E\u0442\u0441\u043B\u0435\u0436\u0438\u0432\u0430\u0442\u044C \u0441\u0432\u043E\u0438 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u044B \u0432 \u0436\u0443\u0440\u043D\u0430\u043B\u0435 <br> \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u043A\u0430\u043A \u0441\u0442\u0443\u0434\u0435\u043D\u0442 \u0438\u043B\u0438 \u0432\u043E\u0439\u0442\u0438 \u043A\u0430\u043A \u043E\u0434\u0438\u043D \u0438\u0437 \u0433\u043E\u0442\u043E\u0432\u044B\u0445 \u043F\u0440\u043E\u0444\u0438\u043B\u0435\u0439 \u0438 \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0438\u0445 \u043F\u0440\u043E\u0433\u0440\u0435\u0441\u0441. <br> \u0412\u044B \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u043E\u0439\u0442\u0438 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0443 \u043A\u0430\u043A \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440. \u0410\u0434\u043C\u0438\u043D\u044B \u043C\u043E\u0433\u0443\u0442 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C, \u0440\u0435\u0434\u0430\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438 \u0443\u0434\u0430\u043B\u044F\u0442\u044C \u0442\u0435\u0441\u0442\u044B; \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438 \u0440\u0430\u0437\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439; \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u043D\u043E\u0432\u044B\u0435 \u0443\u0447\u0451\u0442\u043D\u044B\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u043E\u0432. <br> \u0422\u0430\u043A \u0436\u0435, \u0432 \u044D\u0442\u043E\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0435 \u0435\u0441\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0445 \u0444\u0443\u043D\u043A\u0446\u0438\u0439: \u0421\u043C\u0435\u043D\u0430 \u044F\u0437\u044B\u043A\u0430 \u0438\u043D\u0442\u0435\u0440\u0444\u0439\u0441\u0430 (\u0440\u0443\u0441\u0441\u043A\u0438\u0439 \u0438 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439), \u0430 \u0442\u0430\u043A \u0436\u0435 \u0441\u0442\u0438\u043B\u044F \u0441\u0430\u0439\u0442\u0430 (\u0442\u0451\u043C\u043D\u044B\u0439 \u0438 \u0441\u0432\u0435\u0442\u043B\u044B\u0439).
index.guest.sampleusers = \u041F\u0440\u0438\u043C\u0435\u0440\u044B \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439
index.guest.messagebottom = <a href="/Testing/Register"> \u0417\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0439\u0442\u0435\u0441\u044C </a> \u0438\u043B\u0438 <a href="/Testing/Login"> \u0432\u043E\u0439\u0434\u0438\u0442\u0435 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0443 </a>

index.student.message = \u0414\u043E\u0431\u0440\u043E \u043F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C \u0432 Test Center! <br> \u0417\u0434\u0435\u0441\u044C \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0440\u043E\u0439\u0442\u0438 \u0442\u0435\u0441\u0442\u044B \u043F\u043E \u043C\u043D\u043E\u0433\u0438\u043C \u043F\u0440\u0435\u0434\u043C\u0435\u0442\u0430\u043C, \u043E\u0442 \u043C\u0430\u0442\u0435\u043C\u0430\u0442\u0438\u043A\u0438 \u0438 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0434\u043E \u0431\u0438\u043E\u043B\u043E\u0433\u0438\u0438. <br> \u0412\u0430\u043C \u0431\u0443\u0434\u0435\u0442 \u0434\u0430\u043D\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u043D\u0430 \u043F\u0440\u043E\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u0435 \u0442\u0435\u0441\u0442\u0430. \u041F\u043E \u043F\u0440\u043E\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u0438 \u0435\u0433\u043E \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u044B \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u0432 \u0436\u0443\u0440\u043D\u0430\u043B. <br> \u0412\u044B \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u044F\u0437\u044B\u043A \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \u043C\u0435\u0436\u0434\u0443 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u043C \u0438 \u0440\u0443\u0441\u0441\u043A\u0438\u043C, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u0441\u0442\u0438\u043B\u044C \u043C\u0435\u0436\u0434\u0443 \u0441\u0432\u0435\u0442\u043B\u044B\u043C \u0438 \u0442\u0451\u043C\u043D\u044B\u043C.
index.student.header = \u041D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0438\u0437 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0445 \u0442\u0435\u0441\u0442\u043E\u0432
index.student.messagebottom = \u041F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 <a href="/Testing/Tests"> \u043F\u043E\u043B\u043D\u044B\u0439 \u0441\u043F\u0438\u0441\u043E\u043A \u0442\u0435\u0441\u0442\u043E\u0432 </a> \u0438\u043B\u0438 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u0441\u0432\u043E\u0439 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043F\u0440\u043E\u0433\u0440\u0435\u0441\u0441 \u0432 <a href="/Testing/Journal"> \u0432\u0430\u0448\u0435\u043C \u0436\u0443\u0440\u043D\u0430\u043B\u0435 </ \u0430>.

index.admin.message = \u0414\u043E\u0431\u0440\u043E \u043F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C \u0432 \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0439 \u0446\u0435\u043D\u0442\u0440, \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440! <br> \u0412\u0430\u0448\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 - \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u0442\u044C \u043F\u0440\u043E\u0444\u0438\u043B\u044F\u043C\u0438 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439, \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u043B\u0438 \u0440\u0430\u0437\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u0445, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u0442\u044C \u0442\u0435\u0441\u0442\u0430\u043C\u0438.<br> \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0440\u0435\u0434\u0430\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C, \u0443\u0434\u0430\u043B\u044F\u0442\u044C \u0438\u043B\u0438 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u043D\u043E\u0432\u044B\u0435 \u0442\u0435\u0441\u0442\u044B, \u0432\u043E\u043F\u0440\u043E\u0441\u044B \u0438 \u043E\u0442\u0432\u0435\u0442\u044B. <br> \u0412\u044B \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u044F\u0437\u044B\u043A \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \u043C\u0435\u0436\u0434\u0443 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u043C \u0438 \u0440\u0443\u0441\u0441\u043A\u0438\u043C, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u0441\u0442\u0438\u043B\u044C \u043C\u0435\u0436\u0434\u0443 \u0441\u0432\u0435\u0442\u043B\u044B\u043C \u0438 \u0442\u0451\u043C\u043D\u044B\u043C.
index.admin.header = \u041F\u0440\u0438\u043C\u0435\u0440\u044B \u0442\u0435\u0441\u0442\u043E\u0432
index.admin.messageBottom = \u041F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 <a href="/Testing/Tests"> \u043F\u043E\u043B\u043D\u044B\u0439 \u0441\u043F\u0438\u0441\u043E\u043A \u0442\u0435\u0441\u0442\u043E\u0432 \u0438\u043B\u0438 \u0437\u0430\u0439\u0434\u0438\u0442\u0435 \u0432 </a>\u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 <a href="/Testing/Users"> </a>.

#Login
login.title = \u0412\u0445\u043E\u0434 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0443
login.header = \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0432\u043E\u0439\u0434\u0438\u0442\u0435 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0443
login.messagebottom = \u0423 \u0414\u043E\u043D \u0435\u0441\u0442\u044C \u0443\u0447\u0435\u0442\u043D\u0430\u044F \u0437\u0430\u043F\u0438\u0441\u044C? <a href="/Testing/Register"> \u0417\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0439\u0442\u0435\u0441\u044C! </a>

#Register
register.title = \u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
register.header = \u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
register.error.title = \u041E\u0448\u0438\u0431\u043A\u0430
register.login = \u0412\u043E\u0439\u0442\u0438
register.password = \u041F\u0430\u0440\u043E\u043B\u044C
register.password2 = \u041F\u043E\u0432\u0442\u043E\u0440\u0438\u0442\u0435 \u043F\u0430\u0440\u043E\u043B\u044C
register.name = \u0418\u043C\u044F
register.messagebottom = \u0423\u0436\u0435 \u0435\u0441\u0442\u044C \u0443\u0447\u0435\u0442\u043D\u0430\u044F \u0437\u0430\u043F\u0438\u0441\u044C? <a href="/Testing/Login"> \u0412\u043E\u0439\u0434\u0438\u0442\u0435 </a>

#Tests page
tests.title = \u0422\u0435\u0441\u0442\u044B
tests.student.header = \u0414\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0435 \u0442\u0435\u0441\u0442\u044B
tests.student.message = \u0421\u043F\u0438\u0441\u043E\u043A \u0432\u0441\u0435\u0445 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0445 \u0442\u0435\u0441\u0442\u043E\u0432. \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u0445, \u043D\u0430\u0436\u0430\u0432 \u043D\u0430 \u0438\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430. <br> \u0427\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043E\u0431 \u044D\u0442\u043E\u043C \u0442\u0435\u0441\u0442\u0435 \u043D\u0430\u0436\u043C\u0438\u0442\u0435 \u043D\u0430 \u0435\u0433\u043E \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435.
tests.admin.header = \u0412\u0441\u0435 \u0442\u0435\u0441\u0442\u044B
test.name = \u0418\u043C\u044F
tests.descr = \u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435
tests.diff = \u0421\u043B\u043E\u0436\u043D\u043E\u0441\u0442\u044C
tests.time = \u0414\u0430\u043D\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F
test.questions = \u0412\u043E\u043F\u0440\u043E\u0441\u044B
tests.min = \u043C\u0438\u043D

##Student pages
#Journal
journal.title = \u0422\u0435\u0441\u0442\u044B
journal.message = \u0422\u0443\u0442 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0441\u043F\u0438\u0441\u043E\u043A \u0432\u0441\u0435\u0445 \u043F\u0440\u043E\u0439\u0434\u0435\u043D\u043D\u044B\u0445 \u0442\u0435\u0441\u0442\u043E\u0432, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0432\u0430\u0448\u0438 \u043E\u0446\u0435\u043D\u043A\u0438.
journal.name = \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435
journal.grade = \u041E\u0446\u0435\u043D\u043A\u0430
journal.time = \u0417\u0430\u0442\u0440\u0430\u0447\u0435\u043D\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F
journal.date = \u0414\u0430\u0442\u0430 \u043F\u0440\u043E\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F

#Test info
testinfo.diff = \u0421\u043B\u043E\u0436\u043D\u043E\u0441\u0442\u044C
testinfo.subj = \u041F\u0440\u0435\u0434\u043C\u0435\u0442
testinfo.message1 = \u0412\u0430\u0448 \u043E\u0431\u0449\u0438\u0439 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0442\u0435\u0441\u0442\u0430 \u0440\u0430\u0432\u0435\u043D \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u0443 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0445 \u043E\u0442\u0432\u0435\u0442\u043E\u0432 \u043D\u0430 \u0432\u043E\u043F\u0440\u043E\u0441\u044B. \u042D\u0442\u0438 \u0432\u043E\u043F\u0440\u043E\u0441\u044B \u043C\u043E\u0433\u0443\u0442 \u0438\u043C\u0435\u0442\u044C \u043E\u0434\u0438\u043D \u0438\u043B\u0438 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0445 \u043E\u0442\u0432\u0435\u0442\u043E\u0432, \u043D\u043E \u0432\u043E\u043F\u0440\u043E\u0441 \u0441\u0447\u0438\u0442\u0430\u0435\u0442\u0441\u044F \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u043C, \u0435\u0441\u043B\u0438 \u0432\u044B \u043E\u0442\u043C\u0435\u0442\u0438\u043B\u0438 \u0432\u0441\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0435 \u0432\u043E\u043F\u0440\u043E\u0441\u044B \u0438 \u043D\u0438 \u043E\u0434\u043D\u043E\u0433\u043E \u043D\u0435\u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E\u0433\u043E.
testinfo.message2 = \u0412\u0430\u0448\u0438 \u043E\u0442\u0432\u0435\u0442\u044B \u043D\u0435 \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u044E\u0442\u0441\u044F \u043F\u0440\u0438 \u043F\u0435\u0440\u0435\u0433\u0440\u0443\u0437\u043A\u0435 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0442\u0435\u0441\u0442\u0430 \u043D\u0435 \u0441\u0442\u043E\u0438\u0442.

testinfo.questions = \u0412\u043E\u043F\u0440\u043E\u0441\u044B
testinfo.time = \u0414\u0430\u043D\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F

#Test questions
testquestions.questions = \u0412\u043E\u043F\u0440\u043E\u0441\u044B
testquestions.back = \u041D\u0430\u0437\u0430\u0434
testquestions.confirm = \u041E\u0442\u0432\u0435\u0442\u0438\u0442\u044C
testquestions.next = \u0414\u0430\u043B\u044C\u0448\u0435

#Test results
testresult.title = \u0437\u0430\u0432\u0435\u0440\u0448\u0451\u043D
testresult.header = \u0412\u044B \u0437\u0430\u043A\u043E\u043D\u0447\u0438\u043B\u0438
testresult.result = \u0420\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442
testresult.passed = \u0422\u0435\u0441\u0442 \u043F\u0440\u043E\u0439\u0434\u0435\u043D
testresult.failed = \u0442\u0435\u0441\u0442 \u043F\u0440\u043E\u0432\u0430\u043B\u0435\u043D
testresult.correctquestions = \u041F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0435 \u0432\u043E\u043F\u0440\u043E\u0441\u044B
testresult.messagebottom = \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0432\u0441\u0435 \u0432\u0430\u0448\u0438 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u044B \u0442\u0435\u0441\u0442\u043E\u0432 \u0432 <a href="/Testing/Journal"> \u0441\u0432\u043E\u0435\u043C \u0436\u0443\u0440\u043D\u0430\u043B\u0435 </a>, <a href="/Testing/Tests/${testaddress}"> \u043F\u0440\u043E\u0439\u0442\u0438 \u044D\u0442\u043E\u0442 \u0442\u0435\u0441\u0442 \u0441\u043D\u043E\u0432\u0430 </a> \u0438\u043B\u0438 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C <a href="/Testing/Tests"> \u0434\u0440\u0443\u0433\u0438\u0435 \u0442\u0435\u0441\u0442\u044B </a>.

##Admin pages
#Users page
users.login = \u0412\u0445\u043E\u0434
users.password = \u041F\u0430\u0440\u043E\u043B\u044C
users.role = \u0420\u043E\u043B\u044C
users.name = \u0418\u043C\u044F
users.blocked = \u0411\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u043D


###Error messages
error.accessOOB = \u0423\u0440\u043E\u0432\u043D\u044C \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0432\u043D\u0435 \u043E\u0437\u043D\u0430\u0447\u0435\u043D\u043D\u044B\u0445 \u0433\u0440\u0430\u043D\u0438\u0446. \u042D\u0442\u043E\u0433\u043E \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u043B\u0443\u0447\u0438\u0442\u044C\u0441\u044F. \u0412\u0430\u0443. \u041F\u0435\u0440\u0435\u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u043E \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 \u0441 \u043E\u0448\u0438\u0431\u043A\u043E\u0439.
error.blocked = \u0412\u044B \u0432 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u043D\u044B \u0438 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u043E\u0439\u0442\u0438 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0443. <br> \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0441\u0432\u044F\u0436\u0438\u0442\u0435\u0441\u044C \u0441 \u0432\u0430\u0448\u0438\u043C \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u043E\u043C, \u0447\u0442\u043E\u0431\u044B \u0432\u0430\u0441 \u0440\u0430\u0437\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u043B\u0438.
error.authfail = \u0410\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u044F \u043F\u0440\u043E\u0432\u0430\u043B\u0435\u043D\u0430: \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D \u0438\u043B\u0438 \u043F\u0430\u0440\u043E\u043B\u044C \u043D\u0435\u0432\u0435\u0440\u0435\u043D.
error.serveroffline = \u0421\u0435\u0440\u0432\u0435\u0440 \u0411\u0414 \u043E\u0442\u043A\u043B\u044E\u0447\u0435\u043D. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043E\u0431\u0440\u0430\u0442\u0438\u0442\u0435\u0441\u044C \u043A \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u043C\u0443 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u0443.
error.valuetoolong = \u041E\u0434\u043D\u043E \u0438\u0437 \u0432\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0445 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u0432\u0435\u043B\u0438\u043A\u043E. <br> \u0422\u0430\u043A\u0436\u0435 \u043F\u043E\u0437\u0434\u0440\u0430\u0432\u043B\u044F\u044E \u0432\u0430\u0441 \u0441 \u043E\u0431\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u0435\u043C \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0439 JS. \u041D\u0435 \u0437\u043D\u0430\u044E, \u0437\u0430\u0447\u0435\u043C, \u043D\u043E \u0432\u0430\u043C \u044D\u0442\u043E \u0443\u0434\u0430\u043B\u043E\u0441\u044C.
error.valueunique = \u041E\u0434\u043D\u043E \u0438\u0437 \u0432\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0445 \u0432\u0430\u043C\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u044B\u043C (\u0438\u043C\u044F \u0438\u043B\u0438 \u043B\u043E\u0433\u0438\u043D), \u043F\u043E\u0432\u0442\u043E\u0440\u044F\u0435\u0442\u0441\u044F. \u041F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0432\u0432\u0435\u0441\u0442\u0438 \u0434\u0440\u0443\u0433\u043E\u0439.
error.internaldb = <br> \u042D\u0442\u0430 \u043E\u0448\u0438\u0431\u043A\u0430 \u0432\u044B\u0437\u0432\u0430\u043D\u0430 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u043C\u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430\u043C\u0438 DBManager. \u042D\u0442\u043E \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u043E\u0439\u0442\u0438. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043E\u0431\u0440\u0430\u0442\u0438\u0442\u0435\u0441\u044C \u043A \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u043C\u0443 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u0443.
error.testfail = \u041E\u0448\u0438\u0431\u043A\u0430 \u043F\u043E\u0438\u0441\u043A\u0430 \u0442\u0435\u0441\u0442\u0430. \u0421\u043A\u043E\u0440\u0435\u0435 \u0432\u0441\u0435\u0433\u043E, \u044D\u0442\u043E \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445. \u041E\u0431\u0440\u0430\u0442\u0438\u0442\u0435\u0441\u044C \u043A \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u043C\u0443 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u0443.
error.journalfail = \u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0442\u0435\u0441\u0442\u0430. \u0412\u0435\u0440\u043E\u044F\u0442\u043D\u043E, \u044D\u0442\u043E \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445. \u041E\u0431\u0440\u0430\u0442\u0438\u0442\u0435\u0441\u044C \u043A \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u043C\u0443 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u0443.

### Misc.
# Difficulties
diff.veasy = \u041E\u0447\u0435\u043D\u044C \u043B\u0451\u0433\u043A\u0438\u0439
diff.easy = \u041B\u0451\u0433\u043A\u0438\u0439
diff.medium = \u0421\u0440\u0435\u0434\u043D\u0438\u0439
diff.hard = \u0421\u043B\u043E\u0436\u043D\u044B\u0439
diff.vhard = \u041E\u0447\u0435\u043D\u044C \u0421\u043B\u043E\u0436\u043D\u044B\u0439
diff.undef = \u041D\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0439

#Roles
role.admin = \u0410\u0434\u043C\u0438\u043D
role.student = \u0421\u0442\u0443\u0434\u0435\u043D\u0442
role.guest = \u0413\u043E\u0441\u0442\u044C

###NEW
tests.admin.message = \u042D\u0442\u043E \u0441\u043F\u0438\u0441\u043E\u043A \u0432\u0441\u0435\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0445 \u0442\u0435\u0441\u0442\u043E\u0432, \u0432\u043A\u043B\u044E\u0447\u0430\u044F \u043F\u0443\u0441\u0442\u044B\u0435. \u0427\u0442\u043E\u0431\u044B \u043E\u0442\u0440\u0435\u0434\u0430\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0442\u0435\u0441\u0442 (\u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0435\u0433\u043E \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B, \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C / \u0443\u0434\u0430\u043B\u0438\u0442\u044C \u0432\u043E\u043F\u0440\u043E\u0441\u044B \u0438\u043B\u0438 \u043E\u0442\u0432\u0435\u0442\u044B), \u0449\u0435\u043B\u043A\u043D\u0438\u0442\u0435 \u0438\u043C\u044F \u0442\u0435\u0441\u0442\u0430. <br> \u0412\u044B \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u0443\u0434\u0430\u043B\u0438\u0442\u044C \u0442\u0435 \u0442\u0435\u0441\u0442\u044B, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0432\u0430\u043C \u043D\u0435 \u043D\u0443\u0436\u043D\u044B.
tests.admin.button = \u041D\u043E\u0432\u044B\u0439
tests.admin.delete = \u0423\u0434\u0430\u043B\u0438\u0442\u044C
error.usersfail = \u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043F\u043E\u0438\u0441\u043A \u0442\u0435\u0441\u0442\u043E\u0432. \u0412\u0435\u0440\u043E\u044F\u0442\u043D\u043E, \u044D\u0442\u043E \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445. \u041E\u0431\u0440\u0430\u0442\u0438\u0442\u0435\u0441\u044C \u043A \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u043E\u043C\u0443 \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u0443.
users.setban = \u0423\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0431\u043B\u043E\u043A
users.title = \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438
users.header = \u0421\u043F\u0438\u0441\u043E\u043A \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439
users.message = \u042D\u0442\u043E \u0441\u043F\u0438\u0441\u043E\u043A \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439. \u0417\u0434\u0435\u0441\u044C \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0443\u0434\u0430\u043B\u044F\u0442\u044C \u0443\u0447\u0435\u0442\u043D\u044B\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439, \u043F\u0440\u043E\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u0442\u044C \u0438\u0445 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E (\u043A\u0440\u043E\u043C\u0435 \u043F\u0430\u0440\u043E\u043B\u0435\u0439), \u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C\\u0440\u0430\u0437\u0431\u043B\u043E\u043A\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u0445 \u0438\u043B\u0438 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u043D\u043E\u0432\u044B\u0445 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439. <br> \u042D\u0442\u043E \u0435\u0434\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0439 \u0441\u043F\u043E\u0441\u043E\u0431 \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0443\u0447\u0451\u0442\u043D\u0443\u044E \u0437\u0430\u043F\u0438\u0441\u044C \u0435\u0449\u0451 \u043E\u0434\u043D\u043E\u0433\u043E \u0430\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\u0430 (\u043A\u0440\u043E\u043C\u0435 \u043F\u0440\u044F\u043C\u043E\u0439 \u0432\u0441\u0442\u0430\u0432\u043A\u0438 \u0432 \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445)
users.button = \u041D\u043E\u0432\u044B\u0439 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C
users.createuser = \u0421\u043E\u0437\u0434\u0430\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
testinfo.starttest = \u041D\u0430\u0447\u0430\u0442\u044C \u0442\u0435\u0441\u0442
testedit.title = \u0420\u0435\u0434\u0430\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435
testedit.button = \u0418\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u0442\u0435\u0441\u0442\u043E\u0432\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E
testedit.questions = \u0412\u043E\u043F\u0440\u043E\u0441\u044B \u0442\u0435\u0441\u0442\u0430
testedit.questionedit = \u0418\u0437\u043C\u0435\u043D\u0438\u0442\u044C
testedit.newquestion = \u041D\u043E\u0432\u044B\u0439 \u0432\u043E\u043F\u0440\u043E\u0441
testedit.newanswer = \u041D\u043E\u0432\u044B\u0439 \u043E\u0442\u0432\u0435\u0442
testedit.create = \u0421\u043E\u0437\u0434\u0430\u0442\u044C

tests.name = \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435
tests.subj = \u041F\u0440\u0435\u0434\u043C\u0435\u0442
tests.questions = \u0412\u043E\u043F\u0440\u043E\u0441\u044B
journal.average = \u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043E\u0446\u0435\u043D\u043A\u0430